// 정답에 대한 풀이를 적어주세요 !
// 만약 풀이 과정에서 코드가 필요하다면 코드도 작성 부탁드립니다 !

// 1번 문제 : 먼저 html file과 js file 연결하기 !

// A1. <script src = "report.js"></script>
// A2. 
// <script>
//     JS code 작성
// </script>

// 2번 문제 : Backend에서 얼마나 많은 프로그래밍 언어들을 사용할까요 ?
//A. 10개 이상

// 3번 문제 : Frontend에서 얼마나 많은 프로그래밍 언어들을 사용할까요 ?
//A. 자바스크립트 하나

// 4번 문제 : 자바스크립트로 비디오 게임을 만들 수 있을까요 ?
//A. Yes

// 5번 문제 : 자바스크립트는 모든 브라우저들에 설치되어 있을까요 ?
//A. Yes

// 6번 문제 : 자바스크립트는 만들어진 기간은 얼마일까요 ?
//A. 10일

// 7번 문제 : 왜 자바스크립트는 만들어졌을까요 ?
//A. 좀 더 인터렉티브한 웹사이트를 만들기 위해 

// 8번 문제 : 웹사이트에서 자바스크립트를 사용하려면 처음에 다운로드 해야할까요 ?
//A. No

// 9번 문제 : 자바스크립트를 실행하기위해 브라우저를 열어야할까요 ?
//A. No

// 10번 문제 : 브라우저에서 자바스크립트 파일을 실행하기위해 어떻게 해야할까요 ?
//A. HTML file에 JS file을 불러와 연다!

// 11번 문제 : 브라우저에서 console로 무엇을 할 수있을까요 ?
//A. 자바스크립트 코드 작성!

// 실습 코드 예시
// const a = 1.2;
// const b = 1;
// console.log(a, b)
// console.log(typeof(a), typeof(b)) 

// type을 확인하고 싶으면 ? 
//A. typeof( )를 사용합니다.

// console로 찍고 싶으면 ? 
//A. console.log()를 사용합니다.

// 변수를 선언하고 싶으면 ? 
//A. let 혹은 const 예약어를 변수 앞에 붙여 변수를 선언합니다.

// 세가지를 잘 생각하며 실습해보세요 ! 
// A. 
// const x = 2.5;
// const y = 132;
// console.log(x,y);
// console.log(typeof(x),typeof(y));
// > 2.5 132
// > number number

// 12번 문제 : 2와 2.2는 모두 같은 정수들일까 ?
//A. No

// 13번 문제 : “2”의 데이터 타입은 무엇일까 ?
//A. 문자,문자열

// 14번 문제 : ‘hello’ 와 “hello” 는 같은 것일까 ?
//A. Yes
// let a = "hello"
// let b = 'hello';
// if(a === b){
//     console.log("hello");
// }
// > hello

// 15번 문제 : 변수는 숫자 값만을 저장할 수 있을까 ?
//A. No

// 16번 문제 : const 에 값을 저장 후 변경이 가능할까 ?
//A. No 

// 17번 문제 : let 에 값을 저장 후 변경이 가능할까 ?
//A. Yes

// 18번 문제 : “true”는 Boolean 값일까 ?
//A. No

// 19번 문제 : null과 undefined는 같은 데이터 타입일까 ?
//A. No
// typeof(null)
// >'object'
// typeof(undefined)
// >'undefined'

// 20번 문제 : 배열을 사용하는 이유는 무엇일까 ?
//A. 리스트에 값들을 정리하기 위해! / 변수들을 빠르게 만들기 위해!
// 배열을 사용하여 데이터를 효과적으로 정리할 수 있으며 
// 변수를 하나하나씩 선언을 한다면 불필요한 일을 많이 하는 것이며 가독성이 좋지 않다.

// 21번 문제 : 배열 두 번째 요소의 값을 어떻게 얻을 수 있을까 ?
//A. 배열이 담긴 변수 명[1]

// 22번 문제 : 객체 player의 name의 값을 어떻게 얻을 수 있을까 ?
//A. player.name
//A. player["name"]